[
    {
        "quote": "Sean Chen played beautifully all week, making real musical statements. The Bartók Concerto No. 2 that he played in the finals was stupendous. He brought this piece to life in a totally convincing way, and for me it was the best performance of this concerto that I have ever heard.",
        "short": "It was the best performance of [Bartók Concerto No. 2] that I have ever heard.",
        "author": "Gerard Schwarz, guest conductor, Indianapolis Symphony Orchestra",
        "shortAuthor": "Gerard Schwarz",
        "oldDate": "4/21/13"
    },
    {
        "quote": "The performance blazed with color and excitement",
        "short": "",
        "author": "Robert Weirich, International Piano",
        "shortAuthor": "",
        "oldDate": "July/August 2013"
    },
    {
        "quote": "Chen shaped his phrases masterfully and displayed technical prowess as well as an ear for lyricism. Hes not only an artist with flair, but he also knows how to collaborate with an orchestra, and rarely took his eyes off of Slatkin. His phrasing breathed, and he also knew where to build momentum.",
        "short": "Chen shaped his phrases masterfully and displayed technical prowess as well as an ear for lyricism.",
        "author": "Janelle Gelfand, Cincinnati Enquirer",
        "shortAuthor": "Cincinnati Enquirer",
        "oldDate": "6/8/2013"
    },
    {
        "quote": "Perhaps more than any other competitor in this years field, Chen has brought star power to the stage, a handsome young musician with a thick mop of black hair who is not above theatrics at the keyboard. But his charm derives mostly from his demeanor, on and off stage. He seems utterly imperturbable, \"chill,\" in the vernacular of his home state.",
        "short": "",
        "author": "Tim Madigan, Fort Worth Star-Telegram",
        "shortAuthor": "",
        "oldDate": "6/8/2013"
    },
    {
        "quote": "...genuinely sensitive...",
        "short": "...genuinely sensitive...",
        "author": "Mark Swed, LA Times",
        "shortAuthor": "Mark Swed, LA Times",
        "oldDate": "January 2016"
    },
    {
        "quote": "Ravels Valses nobles et sentimentales (\"Noble and Sentimental Waltzes\") was Chens best playing of the recital. His playing was elegant and very much in the style that Ravel intended. He made some dramatic uses of silence as well. One example is the fermata on the rest in the second ending of No. 4. He took a long time here and it worked brilliantly to clear the air before continuing. He did the same thing before No. 8. His tempi were also right on. The tempo of No. 3 was especially breezy, reminiscent of a sunny Sunday afternoon in Paris in a croissant-and-café au lait kind of way. A marvelous performance of a subtle piece.",
        "short": "",
        "author": "Gregory Sullivan Isaacs, Theater Jones, TX",
        "shortAuthor": "",
        "oldDate": "6/4/2013"
    },
    {
        "quote": "He's 24, and already this American shooting star has a wall full of prizes. ...Seeing him perform, there's little wonder that he is so successful. He has stage presence without overdoing it and amazing technique. He also overflows with confidence, but without a trace of arrogance to contaminate his personality.",
        "short": "",
        "author": "Gregory Sullivan Isaacs, Theater Jones, TX",
        "shortAuthor": "Theater Jones",
        "oldDate": "5/26/2013"
    },
    {
        "quote": "APAs Sean Chen dazzles audience...The Bartók Etudes are studies (\"etudes\" translated) in the most difficult of piano playing in his modernist idiom. Chen sailed through them as if they were childs play. But he reserved the most astonishing part of his recital for his own La Valse. Summoning every device the modern grands 88 keys can expend, Chen delivered as near an orchestral version of the 15 minute piece as is possible to conceive... Chens keyboard sparkled.",
        "short": "Summoning every device the modern grands 88 keys can expend, Chen delivered as near an orchestral version of [La Valse] as is possible to conceive... Chens keyboard sparkled.",
        "author": "Tom Aldridge, NUVO, Indianapolis",
        "shortAuthor": "NUVO",
        "oldDate": "11/11/2012"
    },
    {
        "quote": "His résumé is so crammed with concerts, competitions and ensemble work, its a wonder that he could sit down at the piano on the Oxnard Performing Arts and Convention Center stage Friday night and play both Rachmaninovs Variations on a Theme by Paganini and Miklós Rózsas \"Spellbound\" concerto with aplomb. Hands and mind obviously on alert, he brought piquant charm and prodigious fingerwork to play in the former, and a lush and ruminative spirit to the latter, all without the need of a score before him. His technical skill is assured, honed beyond solo work through collaborative efforts at Juilliard.",
        "short": "He brought piquant charm and prodigious fingerwork to play in [Rachmaninoff Paganini Rhapsody] and a lush and ruminative spirit to the [Rozsa Spellbound Concerto].",
        "author": "Rita Moran, Ventura County Star, CA",
        "shortAuthor": "Ventura County Star",
        "oldDate": "1/30/2009"
    },
    {
        "quote": "Sean Chen has been an audience favorite from the early rounds. With his floppy hair and outstanding stage presence combined with an extraordinary technique and musicianship, this is little wonder.",
        "short": "",
        "author": "Gregory Isaacs, TheaterJones",
        "shortAuthor": "",
        "oldDate": "June 2013"
    },
    {
        "quote": "Sean Chen brought everything to a rousing close with a Rachmaninov 3rd that had the crowd not just standing (which they did for every performance) but cheering loudly.",
        "short": "",
        "author": "Chuck Lavazzi, KDHX",
        "shortAuthor": "",
        "oldDate": "June 2013"
    },
    {
        "quote": "By the time we were a few bars into the Allemande of the Bach French Suite No. 5, I knew we were in the hands of a mature and nuanced player. Chen kept the Baroque sensibility while highlighting what our instrument has to offer: shading, subtle variations in tone, a multitude of articulations, and a wealth of dynamics. As a bonus, his playing inspired me to think, \"He swings!\" He swung in the Courante, he swung in the Gigue–he had rhythmic vitality to spare.",
        "short": "...A mature and nuanced player... Chen kept the Baroque sensibility while highlighting what our instrument has to offer: shading, subtle variations in tone, a multitude of articulations, and a wealth of dynamics.",
        "author": "Susan Geffen, Clavier Companion",
        "shortAuthor": "Susan Geffen, Clavier Companion",
        "oldDate": "June 2013"
    },
    {
        "quote": "Sean Chen performed Rachmaninoff's Concerto No. 3. In the first movement cadenza, he summoned massive, orchestral sonorities, yet he could also play with enormous delicacy. It was a muscular, impassioned performance, and you felt that he is an artist with something to say.",
        "short": "It was a muscular, impassioned performance, and you felt that he is an artist with something to say.",
        "author": "Janelle Gelfand, Cincinnati Enquirer",
        "shortAuthor": "Janelle Gelfand, Cincinnati Enquirer",
        "oldDate": "June 2013"
    },
    {
        "quote": "There's an undeniable spark in Chen's playing that keeps the ears engaged.",
        "short": "There's an undeniable spark in Chen's playing that keeps the ears engaged.",
        "author": "Donald Rosenberg, The Plain Dealer (Cleveland)",
        "shortAuthor": "Donald Rosenberg, The Plain Dealer (Cleveland)",
        "oldDate": "June 2013"
    },
    {
        "quote": "Sean Chen continued his exceptional ability to connect with an audience combined with an easy virtuosity to bring the house down with Rach 3.",
        "short": "Sean Chen continued his exceptional ability to connect with an audience combined with an easy virtuosity to bring the house down with Rach 3.",
        "author": "Laurence Vittes, Huffington Post",
        "shortAuthor": "Laurence Vittes, Huffington Post",
        "oldDate": "June 2013"
    },
    {
        "quote": "Sean Chen, the lone remaining American contestant (one has not won since 1997) and coming off a $100,000 triumph in Indianapolis APA Competition, showed energy and eloquence in Beethovens Emperor.",
        "short": "",
        "author": "Laurence Vittes, Huffington Post",
        "shortAuthor": "",
        "oldDate": "June 2013"
    },
    {
        "quote": "The pianist Sean Chen, a 2013 laureate of the American Pianists Association's annual competition, focuses his attention on music (most of it written in the early 20th century) by two Impressionist composers. He offers alluring, colorfully shaded renditions of works including Scriabin's Piano Sonata No. 4, which Mr. Chen likens to \"early Russian jazz\"; Ravel's \"Valses Nobles et Sentimentales\"; and Mr. Chen's own arrangement of Ravel's turbulent \"La Valse.\"",
        "short": "...alluring, colorfully shaded renditions...",
        "author": "Vivien Schweitzer, The New York Times",
        "shortAuthor": "Schweitzer, The New York Times",
        "oldDate": "5/8/14"
    },
    {
        "quote": "Chen displayed both power and delicacy in his interpretation of [Tchaikovsky's Piano Concerto No. 1]. His interplay with the orchestra and Music Director Bohuslav Rattay was remarkable — clearly they were in sync.",
        "short": "",
        "author": "Midland Daily News",
        "shortAuthor": "Midland Daily News",
        "oldDate": "October 2014"
    },
    {
        "quote": "That Chen has performed music near and dear to his iconoclastic musical heart exudes through every moment of this impressive disc, a display of a superior digital talent guided by a penetrating artistic intellect.",
        "short": "That Chen has performed music near and dear to his iconoclastic musical heart exudes through every moment of this impressive disc, a display of a superior digital talent guided by a penetrating artistic intellect.",
        "author": "Gary Lemco, Audiophile Audition",
        "shortAuthor": "Gary Lemco, Audiophile Audition",
        "oldDate": "4/30/14"
    },
    {
        "quote": "Los Angeles native Sean Chen has the rare ability to combine poetic musical sensibilities and dazzling technical prowess. On La Valse, his debut album for Steinway & Sons, Mr. Chen delves into Ravel and Scriabin's solo piano works. The recording is a part of Chen's award package as the winner of the American Pianists Association's DeHaan Classical Fellowship. Mr. Chen's charisma, remarkable musical depth and talent for coaxing subtle and surprising colors and textures from each work on the recording are only a few reasons to listen to La Valse more than once.",
        "short": "Los Angeles native Sean Chen has the rare ability to combine poetic musical sensibilities and dazzling technical prowess.",
        "author": "Paula Edelstein, LA Music Examiner",
        "shortAuthor": "Edelstein, LA Music Examiner",
        "oldDate": "4/23/14"
    },
    {
        "quote": "A piano tyro with as much personality as talent, this 25 year old award winner makes his label debut showing his love for pre WWI classical music when world tensions and generational tensions were tearing at the fabric of known classical music forcing it to change with the times. With young people like Chen coming into the tent with so much skill, it bodes well for listeners bored with what they know to enter the classical tent with him and get turned on to new, hidden musical treasures. A killer of a solo recital, Chen sounds like hes here to stay and we should all be glad. It might strike you as a Sunday afternoon chamber recording at first blush but be sure to stick around for the second blush. Well done.",
        "short": "",
        "author": "Chris Spector, Midwest Record",
        "shortAuthor": "",
        "oldDate": "3/26/14"
    },
    {
        "quote": "This discovery of Sean Chen, even in a truncated recital was an astonishing evening. The recital of Sean Chen with 'guest' Dan Tepfer, was an experiment to bridge two worlds of music. ...The problem was that Mr. Chen played the Chopin with such solid fingerwork, such impeccable technique, and such modest understanding that following this would be impossible for an Oscar Peterson, much less a Dan Tepfer. ...The work that he performed [Chen's transcription of La Valse] last night outdid any Ravel transcription I have ever heard. ...It was a 'Whew!' moment, and I prayed that no simple encore would follow. Much as I want to hear Mr. Chen in a full recital (or his celebrated Bartók Second Concerto performance), anything further would have detracted from both the original transcription and the mesmerizing performance.",
        "short": "[Chen's transcription of La Valse] last night outdid any Ravel transcription I have ever heard.",
        "author": "Harry Rolnick, ConcertoNet",
        "shortAuthor": "Harry Rolnick, ConcertoNet",
        "oldDate": "3/17/14"
    },
    {
        "quote": "Chen had earned a reputation for his approachable personality and showmanship. ...Chen assembled an extravagant collection of dance-inspired music, and began his recital with an intimate, whimsical rendition of J.S. Bach's Fifth French Suite in G Major. In a performance that he liberally laced with smile-inducing ornamentations, Chen assigned varied colors and characters to each of the lines, evoking an ensemble performance by several musicians and thus bringing spontaneity and freshness to each of the dances. ...Continuing the theme of the three-quarter rhythm, finishing the recital with the famous La Valse was inevitable, given its scale and drama. Chen upped the ante by presenting his own transcription of the piece, filling in some of the details that Ravel had left out in his own transcription from the original orchestral version. ...The effect was richer than we are used to hearing, and the additional layered details added vibrant orchestral colors. Comparing Chen's transcription to Ravel's own may be like comparing Vladimir Horowitz's arrangement of Franz Liszt's Hungarian Rhapsody No. 2 to Liszt's original: full of audacity, bravura, and showmanship.",
        "short": "Chen had earned a reputation for his approachable personality and showmanship... Comparing Chen's transcription to Ravel's own may be like comparing Vladimir Horowitz's arrangement of Franz Liszt's Hungarian Rhapsody No. 2 to Liszt's original: full of audacity, bravura, and showmanship.",
        "author": "Ken Iisaka, San Francisco Classical Voice",
        "shortAuthor": "Ken Iisaka, San Francisco Classical Voice",
        "oldDate": "9/14/13"
    },
    {
        "quote": "There arent enough superlatives for this young man. Moments of bold intensity gave way to those of a gentle tenderness that was breathtaking at times... Chen placed every note just so. The piano produces sound when hammers strike strings, but you wouldnt know it with Chen. He played the piano like a wind instrument, as if breathing into it to create sounds. It was uncanny.",
        "short": "Moments of bold intensity gave way to those of a gentle tenderness that was breathtaking at times... Chen placed every note just so. The piano produces sound when hammers strike strings, but you wouldnt know it with Chen. He played the piano like a wind instrument, as if breathing into it to create sounds. It was uncanny.",
        "author": "Chantal Incandela, nuvo.net",
        "shortAuthor": "Chantal Incandela, nuvo.net",
        "oldDate": "9/29/14"
    },
    {
        "quote": "Chen seemed...in his element in Rachmaninoff's C Minor Etude Tableau, Op. 39, No. 7, in which he projected Slavic colors and angst with vivid pathos, and in the splendid Copland Piano Variations, in which shards of the four-note theme splatter around the keyboard with abandon. Chen kept it all under tight control while giving an impression of unbridled freedom.",
        "short": "",
        "author": "The Washington Post",
        "shortAuthor": "The Washington Post",
        "oldDate": "October 2014"
    },
    {
        "quote": "Chen's remarkably stylistic shifts and technical prowess never overshadowed the simple joy he evidenced in music making.",
        "short": "Chen's remarkably stylistic shifts and technical prowess never overshadowed the simple joy he evidenced in music making.",
        "author": "Steve Pettit, Killeen Daily Herald",
        "shortAuthor": "Steve Pettit, Killeen Daily Herald",
        "oldDate": "October 2013"
    },
    {
        "quote": "Chen's playing is brilliant, subtle, and spontaneous, and his mastery of the piano's tone colors makes the music highly effective, especially for those who want to hear the audible connections between Ravel and Scriabin.",
        "short": "Chen's playing is brilliant, subtle, and spontaneous, and his mastery of the piano's tone colors makes the music highly effective...",
        "author": "Blair Sanderson, All Music Guide",
        "shortAuthor": "Blair Sanderson, All Music Guide",
        "oldDate": "March 2014"
    },
    {
        "quote": "He captured Mozart's elegant grace and serenity without sounding bland or dull... Chen chose to play Mozart's own cadenzas, but he played the last one with so much good humor that its playful stops and repeats sounded completely spontaneous.",
        "short": "He captured Mozart's elegant grace and serenity...",
        "author": "Tom Purdom, Broad Street Review",
        "shortAuthor": "Tom Purdom, Broad Street Review",
        "oldDate": "March 2015"
    },
    {
        "quote": "The highlight was Chen's first-movement cadenza, which he had composed himself in advance. It was quite long, which allowed him to develop his ideas to a considerable extent, and it was not constrained by any effort to match the style of the concerto that surrounded it. Instead, it grew into a rowdy rhapsody that had more in common with unbuttoned pages of Beethoven's sonatas, or even his improvisational Fantasia, than with anything that lurks within this early piano concerto.",
        "short": "",
        "author": "James Keller, Santa Fe New Mexican",
        "shortAuthor": "",
        "oldDate": "March 2015"
    },
    {
        "quote": "Throughout the [Saint-Saens G minor] Chen allowed the French composer's sinuous melodic strains to shine when they were the focus of the piece, and with just as much command set his nimble fingers free to delineate the enormous challenges set forth for him.",
        "short": "",
        "author": "Ventura County Star",
        "shortAuthor": "",
        "oldDate": "March 2015"
    }
]